Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ཉི་ཁྲི་ དགུ་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཆོས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $424 At that time there was in the east, beyond twenty-nine thousand innumerable universes, a universe known as Dharma , and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཆོས་ ཀྱི་ འབྱུང་གནས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Dharmākara.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡེ་ཤེས་ འབྱུང་གནས་ [69a] ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Jñānākara [69.a] would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ཉི་ཁྲི་ དགུ་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཤིན་ཏུ་ རབ་གནས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $425 At that time there was in the east, beyond twenty-nine thousand innumerable universes, a universe known as Thorough Abidance, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ བཅུ་ ལས་འཕྲོ ས་པ འི་ འོད་ཟེར་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Light Rays in the Ten Directions.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ བཅུ་ ལས་འཕྲོ ས་པ འི་ འོད་ཟེར་ ཅེས་བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Light Rays in the Ten Directions would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ཉི་ཁྲི་ བརྒྱད་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀུན་ཏུ་འོད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $426 At that time there was in the east, beyond twenty-eight thousand innumerable universes, a universe known as Samantaprabha, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རྟག་ ཏུ་ བླ་མ འི་ འོད་ཟེར་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Constant and Supreme Light Rays.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཀུན་ དུ་ སྣང་བ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Samantāloka would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ཉི་ཁྲི་ བརྒྱད་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀུན་ དུ་ སྤོས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $427 At that time there was in the east, beyond twenty-eight thousand innumerable universes, a universe known as Constant Incense, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡེ་ ཤེས་ ཀྱི་ འོད་ཟེར་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Jñānaraśmi.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ མིག་ བཟངས་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Sunetra would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ཉི་ཁྲི་ བདུན་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྤོས་ ཀྱི་ ངད་ ལྡང་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $428 At that time there was in the east, beyond twenty-seven thousand innumerable universes, a universe known as Fumes of Incense, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ མངོན་ འཕགས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Noble Jewel.

source: འཚོ་ ཞིང་ གཞེས་ ལ་ ཆོས་ [69b] ཀྱང་ སྟོན་ ཏེ །_
en: Abiding and remaining present there, he taught the Dharma. [69.b]

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ སྣང་བ་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Amitābha would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ཉི་ཁྲི་ བདུན་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ལམ་ སྣང་ དཔལ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $429 At that time there was in the east, beyond twenty-seven thousand innumerable universes, a universe known as Glorious Light of the Path, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ འོད་ཟེར་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one, a worthy one, a perfect buddha known as Anantarāśmin.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ སྨན་ གྱི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Bhaiṣajyarāja would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ཉི་ཁྲི་ དྲུག་ སྟོང་ འདས་པ་ ན །_ |#| འཇིག་རྟེན་ གྱི་ ཁམས་ བཟང་པོ་ མཆོག་ གི་ དཔལ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $430 At that time there was in the east, beyond twenty-six thousand innumerable universes, a universe known as Glory of the Highest Excellence, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཐོགས་པ་ མེད་པ འི་ དབྱངས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Unhindered Melody .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཚངས་ པ འི་ དབྱངས་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Brahmāghoṣa would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ཉི་ཁྲི་ ལྔ་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཆོས་ བཟངས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $431 At that time there was in the east, beyond twenty-five thousand innumerable universes, a universe known as Dharmabhadra , and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དྲ་བ་ ཅན་ གྱི་ འོད་ཟེར་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one, a worthy one, a perfect buddha known as Jālinīprabha .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཁྱུ་མཆོག་ ཅེས་བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Vṛṣabha would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ཉི་ཁྲི་ བཞི་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ པད་མ་ ཅན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $432 At that time there was in the east, beyond twenty-four thousand innumerable universes, a universe known as Padmavati, [70.a] and

source: དེ་ ན་ དེ་ [70a] བཞིན་ གཤེགས་པ་ བློ་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Anantamati.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡེ་ཤེས་ ཀྱི་ གསུང་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Wisdom Voice would awaken to unsurpassable and perfect buddhahood . . .

source: དེ་ཡང་ འོངས་ ཏེ་ ཞེས་ བྱ་བ་ དང་ །_ དེ་ལྟ་ ལགས་སོ་ ཞེས་ བྱ་བ འི་ བར་ དུ་ སྔ་མ་ བཞིན་ དུ་ སྦྱར་ རོ །།_།།
en: . . . |#| “Yes, indeed,” answered the bodhisattva.

source: བམ་པོ་ དྲུག་པ །_ དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ཉི་ཁྲི་ སུམ་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཤིན་ཏུ་ རྣམ་པར་ དག་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $433 At that time there was in the east, beyond twenty-three thousand innumerable universes, a universe known as Suviśuddha, and

source: དེ་ ན་ དེ་ བཞིན་ གཤེགས་པ་ བཀོད་པ་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one, a worthy one, a perfect buddha known as Infinite Array .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རིན་པོ་ཆེ འི་ བཀོད་པ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Ratnavyūha would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ཉི་ཁྲི་ ཉིས་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཨུད་པ་ ལ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $434 At that time there was in the east, beyond twenty-two thousand innumerable universes, a universe known as Utpala , and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཁྱུ་མཆོག་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Infinite Leader.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཆོས་ འཕགས་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Dharmodgata would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ཉི་ཁྲི་ ཆིག་སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ རབ་གནས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $435 At that time there was in the east, beyond twenty-one thousand innumerable universes, a universe known as Consecrated Branches of Awakening, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཨུད་པ་ ལ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Utpalaśrī.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ པད་མ འི་ དཔལ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Padmaśrī would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ཉི་ཁྲི་ འདས་པ་ ན་ [70b] འཇིག་རྟེན་ གྱི་ ཁམས་ པད་མ་ རབ་གནས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $436 At that time there was in the east, beyond twenty thousand innumerable universes, [70.b] a universe known as Consecrated Lotus, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ རབ་གནས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Abiding Wisdom.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རིན་ཆེན་ རབ་ རྫོགས་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་ པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Perfect Jewel would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ཁྲི་ དགུ་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡེ་ཤེས་ ཀྱི་ སྟོབས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $437 At that time there was in the east, beyond nineteen thousand innumerable universes, a universe known as Jñānabala , and

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རིན་ཆེན་ ཐུབ་པ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Ratnamuni would awaken to unsurpassable and perfect buddhahood . . .

source: དེ་ཡང་ འོངས་ ཏེ་ ཞེས་ བྱ་བ་ དང་ །_ དེ་ལྟ་ ལགས་ སོ་ ཞེས་ བྱ་བ འི་ བར་ དུ་ སྔ་མ་ བཞིན་ དུ་ སྦྱར་ རོ །_།
en: . . . |#| “Yes, indeed,” answered the bodhisattva.

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ཁྲི་ བརྒྱད་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཕྱོགས་ སུ་ རྣམ་པར་ བསྒྲགས་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $438 At that time there was in the east, beyond eighteen thousand innumerable universes, a universe known as Universal Renown, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ རྣམ་པར་ བསྒྲགས་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Wisdom Renown .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམ་པར་ བསྒྲགས་པ་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Infinite Renown would awaken to unsurpassable and perfect buddhahood. . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ཁྲི་ བདུན་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྒྲོགས་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $439 At that time there was in the east, beyond seventeen thousand innumerable universes, a universe known as Nirghoṣa , and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སཱ་ལ འི་ དབང་པོ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ །_
en: within it resided a thus-gone one known as King of Sal Trees.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ སཱ་ལ འི་ རིན་པོ་ཆེ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Jewel of Sal Trees would awaken to unsurpassable and perfect buddhahood. . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་ [71a] རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ཁྲི་ དྲུག་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཟླ་བ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $440 At that time there was in the east, [71.a] beyond sixteen thousand innumerable universes, a universe known as Candra , and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སཱ་ལ་ རིན་པོ་ཆེ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Jewel of Sal Trees.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཀུན་ ཏུ་ སྦས་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Thoroughly Hidden would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ཁྲི་ ལྔ་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $441 At that time there was in the east, beyond fifteen thousand innumerable universes, a universe known as Enduring , and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཁ་ལོ་ བསྒྱུར་བ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Sārathi .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཤིང་རྟ་ བཟང་པོ་ ཅན་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Excellent Chariot would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ཁྲི་ བཞི་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ གདུགས་ གཅིག་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $442 At that time there was in the east, beyond fourteen thousand innumerable universes, a universe known as Single Parasol , and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་པོ་ཆེ འི་ རྟ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Jewel Horse.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱུ་སྐར་ གྱི་ རྟ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Horse of the Heavenly Bodies would awaken to unsurpassable and perfect buddhahood . . .

source: དེ་ཡང་ འོངས་ ཏེ་ ཞེས་ བྱ་བ་ དང་ །_ དེ་ལྟ་ ལགས་སོ་ ཞེས་ བྱ་བ འི་ བར་ དུ་ སྔ་མ་ བཞིན་ དུ་ སྦྱར་ རོ །_
en: . . . |#| “Yes, indeed,” answered the bodhisattva.

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་ རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ཁྲི་ སུམ་ སྟོང་ འདས་པ་ ན །_ |#| འཇིག་རྟེན་ གྱི་ ཁམས་ མྱ་ངན་ ཐམས་ཅད་ དང་ བྲལ་བ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $443 At that time there was in the east, beyond thirteen thousand innumerable universes, a universe known as Free of All Suffering, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ བརྗོད་པ་ དོན་ཡོད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ །_
en: within it resided a thus-gone one known as Meaningful Expression .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ དོན་ཡོད་ མིང་ རྒལ་ ཅེས་བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Meaning Beyond Name would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གྲངས་མེད་པ་ ཁྲི་ ཉིས་ [71b] སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མྱ་ངན་ བྲལ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $444 At that time there was in the east, [71.b] beyond twelve thousand innumerable universes, a universe known as Viśoka, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དཔལ་ འབྱུང་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Śrīsaṃbhava.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ དཔལ་ མཐའ་ ཡ ས་ གཟི་བརྗིད་ ཅེས་བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་ པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Infinite Splendor would awaken to unsurpassable and perfect buddhahood. . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ཁྲི་ ཆིག་སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྡོམ་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $445 At that time there was in the east, beyond eleven thousand innumerable universes, a universe known as Saṃvara , and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རྣམ་པར་ བསྒྲགས་པ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as King of Fame.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ དཔ ས་ བྱིན་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Datta would awaken to unsurpassable and perfect buddhahood . . .

source: དེ་ཡང་ འོངས་ ཏེ་ ཞེས་ བྱ་བ་ དང་ །_ དེ་ ལྟ་ ལགས་སོ་ ཞེས་ བྱ་བ འི་ བར་ དུ་ སྔ་མ་ བཞིན་ དུ་ སྦྱར་ རོ །_།
en: . . . |#| “Yes, indeed,” answered the bodhisattva.

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གྲངས་མེད་པ་ ཁྲི་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མཐོང་བ་ དོན་ཡོད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $446 At that time there was in the east, beyond ten thousand innumerable universes, a universe known as Amoghadarśin, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དོན་ཡོད་ རྣམ་པར་ གནོན་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Meaningful Subduer.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ དོན་ཡོད་པ འི་ གོ་ཆ་ བགོས་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Meaningful Armor would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ ཕྱོགས་ སུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གྲངས་མེད་པ་ དགུ་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྤོས་ ཅན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $447 At that time there was in the east, beyond nine thousand innumerable universes, a universe known as Endowed with Incense, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྤོས་ སྣང་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Incense Light.

source: འཚོ་ ཞིང་ གཞེས་ ལ་ ཆོས་ ཀྱང་ སྟོན་ ཏེ །_།
en: Abiding and remaining present there, he taught the Dharma.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རིན་ཆེན་ སྣང་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Ratnāloka would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གྲངས་མེད་པ་ བརྒྱད་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཚངས་པ འི་ དབྱངས་ [72a] ཀྱི་ ང་རོ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $448 At that time there was in the east, beyond eight thousand innumerable universes, a universe known as Roaring Melody of Brahmā, [72.a] and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཐོགས་པ་ མེད་པ འི་ དབྱངས་ ཀྱི་ ང་རོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Unstoppable Melodious Roar.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཐ་ མི་ དད་པ འི་ གོ་ཆ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Undivided Armor would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གྲངས་མེད་པ་ བརྒྱད་ སྟོང་ ཁོ་ན་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཟླ་བ འི་ དཀྱིལ་འཁོར་ གྱི་ འོད་ཟེར་ ཅེས་བྱ་བ་ ཡོད་ དེ་
en: $449 At that time there was in the east, beyond exactly eight thousand innumerable universes, a universe known as Light Rays of the Disk of the Moon, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རྣམ་པར་ བསྒྲགས་པ འི་ སྟོབས་ ཀྱི་ འོད་ཟེར་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Light Rays of Powerful Renown.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡེ་ཤེས་ རྣམ་པར་ བསྒྲགས་པ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Wisdom Renown would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གྲངས་མེད་པ་ བརྒྱད་ སྟོང་ ཁོ་ན་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀུན་ཏུ་འོད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $450 At that time there was in the east, beyond exactly eight thousand innumerable universes, a universe known as Samantaprabha, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རི་རབ་ ཀྱི་ རྩེ་མོ་ མངོན་པར་ འཕགས་པ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as King of Mount Meru’s Lofty Summit.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡེ་ ཞེས་ ཀྱི་ སྟོབས་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Jñānabala would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ བརྒྱད་ སྟོང་ ཁོ་ན་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རིན་པོ་ཆེ འི་ དཀྱིལ་འཁོར་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $451 At that time there was in the east, beyond exactly eight thousand innumerable universes, a universe known as Ratnamaṇḍala, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་པོ་ཆེ་ མངོན་པར་ འཕགས་པ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Splendor of Superior Jewels.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ དེད་དཔོན་ ཆེན་པོ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Mahāsārthavāha would awaken to unsurpassable and perfect buddhahood . . .

source: དེ་ཡང་ འོངས་ ཏེ་ ཞེས་ བྱ་བ་ དང་ །_ དེ་ལྟ་ ལགས་སོ་ ཞེས་ བྱ་བ འི་ བར་ དུ་ [72b] སྔ་མ་ བཞིན་ དུ་ སྦྱར་ རོ །_།
en: . . . |#| “Yes, indeed,” answered the bodhisattva. [72.b]

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གྲངས་མེད་པ་ བརྒྱད་ སྟོང་ ཁོ་ན་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཆོས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $452 At that time there was in the east, beyond exactly eight thousand innumerable universes, a universe known as Dharma , and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ པད་མ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Padmaśrī.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཨུད་པ་ ལ འི་ དཔལ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Utpalaśrī would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་ མེད་པ་ བརྒྱད་ སྟོང་ ཁོ་ན་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ པད་མ་ མངོན་པར་ འཕགས་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $453 At that time there was in the east, beyond exactly eight thousand innumerable universes, a universe known as Superior Lotus, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་པོ་ཆེ འི་ མངོན་པར་ འཕགས་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Superior Jewel.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ གྲགས་ སྦྱིན་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Yaśodatta would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ བརྒྱད་ སྟོང་ ཁོ་ན་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ས འི་ སྙིང་པོ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $454 At that time there was in the east, beyond exactly eight thousand innumerable universes, a universe known as Kṣitigarbha, and

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ས འི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Royal Lord of the Earth would awaken to unsurpassable and perfect buddhahood . . .
